Revit 2027 API
ParameterTypeId.AnalyticalModelPerimeter Property
 "Perimeter": The Perimeter of Analytical Model
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId AnalyticalModelPerimeter { get; }
Public Shared ReadOnly Property AnalyticalModelPerimeter As ForgeTypeId
	Get
public:
static property ForgeTypeId^ AnalyticalModelPerimeter {
	ForgeTypeId^ get ();
}
static member AnalyticalModelPerimeter : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace